# Basic Arithmetic Operations

You can perform basic arithmetic operations on DataFrame columns like addition, subtraction, multiplication, and division.

In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame({'A':[1,2,3,4],
                    'B':[5,6,7,8]})

In [3]:
df

   A  B
0  1  5
1  2  6
2  3  7
3  4  8

# Addition

In [4]:
df['Add'] = df['A']+df['B']

In [5]:
df

   A  B  Add
0  1  5    6
1  2  6    8
2  3  7   10
3  4  8   12

# Subtraction

In [6]:
df['Sub'] = df['A']-df['B']

In [7]:
df

   A  B  Add  Sub
0  1  5    6   -4
1  2  6    8   -4
2  3  7   10   -4
3  4  8   12   -4

# Multiplication

In [8]:
df['Multi'] = df['A'] * df['B']

In [9]:
df

   A  B  Add  Sub  Multi
0  1  5    6   -4      5
1  2  6    8   -4     12
2  3  7   10   -4     21
3  4  8   12   -4     32

# Division

In [18]:
df['Div'] = df['A'] / df['B']

In [19]:
df

   A  B  Add  Sub  Multi       Div
0  1  5    6   -4      5  0.200000
1  2  6    8   -4     12  0.333333
2  3  7   10   -4     21  0.428571
3  4  8   12   -4     32  0.500000